"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
# код вводити тут
student_age=30         #age int
student_name='Name'    #name str
is_student=True        # if student or not boolean


"""

**2.** Розкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
name2 = "John"   #цифри не йдуть першими в назвах змінних
user_age = 25  # підкреслення нижнє дозволено тільки
price = 100    # спец символи не мають бути в назвах
class_name = "Math"  # не використовуємо ключові слова в назвах змінних
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
# код вводити тут
max_students_number=30
"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
# код вводити тут
course_name='Philosophy'
number_of_hours=220
course_price=3000
"""
**5.** Розрахуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
# код вводити тут
course_vytraty=number_of_hours/course_price
print(f'Витрати курсу = {course_vytraty:.3f} гривень за годину') #обрізка числа до 3 символів після крапки
"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
# код вводити тут
number=42
float_number=float(number)
bin_number=bin(number)
hex_number=hex (number)
oct_number=oct(number)
print(f'Десяткове число:{float_number} \nДвійкове число:{bin_number}')
print(f'Шістнадцяткове число:{hex_number} \nВосьмеричне число:{oct_number}')

"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
# код вводити тут
a=17
b=5
plus=a+b
minus=a-b
mnozhennya=a*b
dilennya=a/b
dilennya_tsile=a//b
zalyshok_vid_dilennya=a%b
stupin=a**b
print(f'Додавання 17 і 5:{plus}, Віднімання: {minus},Множення: {mnozhennya},Ділення: {dilennya},Ділення і результат ціле число:{dilennya_tsile}')
print(f'Залишок від ділення 17 на 5: {zalyshok_vid_dilennya} , число 17 в 5 ступені: {stupin}')
"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
# код вводити тут
PI=3.14159
radius=7.5
ploshcha_kola=PI*radius**2
print(f'Площа кола =πR2, тобто \n{PI}*{radius}**2= {ploshcha_kola}')
"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
# код вводити тут
a=7
b=50%a
c=33%a
d=14%a
print(f'Залишок ділення 50 на 7={b}, 33 на 7={c}, 14 на 7={d}')
"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
# код вводити тут
black_sea_square=436402
azov_sea_square=37800
total_square=black_sea_square+azov_sea_square
print(f'Площа Чорного моря = {black_sea_square} км2, площа Азовського моря = {azov_sea_square} км2.Яка площа обох морів разом?')
print(f'{black_sea_square}+{azov_sea_square}={total_square} km2')
"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
# код вводити тут
name='Victoria'
print(f'Перший символ імені Victoria: {name[0]}')
print(f'Останній символ: {name[-1]}')
print(f'Довжина рядка: {len(name)} символів')
"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
# код вводити тут
text="Would you tell me, please, which way I ought to go from here?" 
print(f'Перші 6 символів: {text[0:6]}')
print(f'Останні 11 символів:{text[-11:]}')
"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
# код вводити тут
'''Життя - заплутана штука. й іноді простого 
розв'язання проблеми просто не існує. 
У такому разі обирайте найпростіший з реальних варіантів.
 Читабельність має значення. 
 (Філософія Python)'''
"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
# код вводити тут
message_hello='Hello'
message_world='World'
print(f'{message_hello} {message_world}')
print(f'{message_hello},{message_world}')
print(f'{message_hello} \n{message_world}')
"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
# код вводити тут
text="Ми називали його просто \"лиходій\" і він знав про це."
print(text)
text_2="Екранування в Python є завдяки символу \\, що йде за символом, який ви хочете вставити."
print(text_2)
"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
# код вводити тут
name='Валерія'
age=40
print(f'Привіт, {name}! Тобі {age} років.')
"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
# код вводити тут
total_photo=232
photo_on_page=8
pages=total_photo/photo_on_page
print(f'Ігор має всього {total_photo} фотографій,а на 1 сторінці в альбом вміщається {photo_on_page}. Cкільки потрібно сторінок?')
print(f'{total_photo}/{photo_on_page}={pages:.0f} сторінок') #() обрізати зайві символи для цілого числа 
# а краще викристати math.ceil() для заокруглення до більшого числа.
"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
# код вводити тут
favourite_color='помаранчевий'
favourite_number='7'
print(f'Ваш улюблений колір {favourite_color}, а улюблене число {favourite_number}.')

"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
# код вводити тут
total_items=375291
first_and_second_storage=250449
second_and_third_storage=222950
first_storage=total_items-second_and_third_storage
third_storage=total_items-first_and_second_storage
second_storage=total_items-first_storage-third_storage
print(f'На складах всього {total_items} товарів. На 1 і 2 складах разом {first_and_second_storage} і на 2 і 3 разом {second_and_third_storage} ')
print(f'На першому складі {total_items}-{second_and_third_storage}={first_storage} товарів')
print(f'На третьому складі {total_items}-{first_and_second_storage}={third_storage} товарів.')
print(f'На другому складі {total_items}-{first_storage}-{third_storage}={second_storage} товарів.')

"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
# код вводити тут
months=18
monthly_cost=1179
total_cost=months*1179
print(f'Михайлу купили компьютер з розстрочкою на {months} місяців і платити потрібно {monthly_cost}грн. кожен місяць. Вартість компьютера?')
print(f'{months}*{monthly_cost}={total_cost} гривень.')  