# # Вправа 1: Проста математика
print("\n=== ВПРАВА 1: Калькулятор ===")
# print("Створіть простий калькулятор для двох чисел і двох дій")
# print("Підтримувані операції: +, -")

# # Початок реалізації:
num1 = float(input("Введіть перше число: "))
operation = input("Введіть операцію (+, -, ): ")
num2 = float(input("Введіть друге число: "))
if '+' in operation:
    print (num1, operation, num2, '=',num1+num2 )
elif '-' in operation:
    print(num1, '-', num2,'=', num1-num2)
else:
    print ('Введені данні невірні')

# # Вправа 2: Перевірка паролю
print("\n=== ВПРАВА 2: Перевірка паролю ===")
# print("Створіть систему перевірки паролю")
# print("Пароль повинен містити принаймні 8 символів")
password = str(input("Введіть пароль: "))
while True: 
    if len(password) < 8:
        print('Пароль має менше 8 символів')
    else: 
        print('Пароль встановлено!')
        break
    password = input('Ввведіть ще раз пароль: ')

# # Вправа 3: Визначення високосного року
print("\n=== ВПРАВА 3: Високосний рік ===")
# print("Рік є високосним, якщо:")
# print("- Ділиться на 4 І не ділиться на 100")
# print("- АБО ділиться на 400")
year = int(input('Введіть рік: '))
if (year%4==0 and year%100!=0) or year%400==0:
    print('Високосний рік')
else:
    print('Рік не високосний')
    
    

# # Вправа 4: Лічильник голосних
print("\n=== ВПРАВА 4: Лічильник голосних ===")
print("Підрахуйте кількість голосних у рядку")

text = input("Введіть текст українською мовою: ").lower()
vowels = "аеиіїоуюя"
count = 0
for char in text:
    if char in vowels:
        count += 1
if count > 0:
    print(f"Кількість голосних: {count}")
else:
    print('Голосних нема')

# # Вправа 5: Гра 
print("\n=== ВПРАВА 5: Гра ===")
# """
# Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
# Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
# Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
# Якщо колір прибульця green, надрукуйте, що гравець щойно заробив 5 балів.
# Якщо колір прибульця yellow, надрукуйте, що гравець щойно заробив 10 балів.
# Якщо колір прибульця red - надрукуйте, що гравець щойно заробив 15 балів.
# Перевірте роботу гри самостійно, змінюючи значення alien_color
# """
alien_color =  input("Введіть g for green, y for yellow, r for red color: ")
if 'g' in alien_color:
    print('гравець щойно заробив 5 балів')
elif 'y' in alien_color:
    print('гравець щойно заробив 10 балів')
elif 'r' in alien_color:
    print('гравець щойно заробив 15 балів')
else:
    print('Error')


# Вправа 6: Піцерія *
print("\n=== ВПРАВА 6: Начинки для піци (pizza_topping) ===")
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""
ingredients = []
while True:
    pizza_topping = input('Введіть інгредієнт або quit для закінчення готування піци: ')
    if pizza_topping == 'quit':
        break
    print(f'{pizza_topping} додано')
    ingredients.append(pizza_topping)
print(f'піца з такими інгредієнтами готова: {ingredients}')
    

#  Вправа 7: Зворотний порядок цифр
print("\n=== ВПРАВА 7: Зворотний порядок ===")
print("Виведіть цифри числа у зворотному порядку")
norm_numbers = str(input('Введіть число: '))
reverse_number = norm_numbers[::-1]
print ('Перевернуте число: ', reverse_number)



# Вправа 8: Пошук максимального числа
print("\n=== ВПРАВА 8: Пошук максимального ===")
print("Знайдіть найбільше число серед введених")
print("Введіть 0 для завершення")
while True:
    numbers = input('Введіть декілька чисел через пробіл або 0 для завершення: ')
    number_list = numbers.split(' ')
    max_number = max(number_list)
    if numbers == '0':
            break
    print(max_number)

                   

# # Вправа 9: Виключення зі списку
print("\n=== ВПРАВА 9: Виключення зі списку ===")
# """  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
# потрібно вивести на екран всі елементи списку, окрім "orange".
# """
fruits = ["apple", "banana", "orange", "grape", "mango"]
for f in fruits:
    if f == 'orange':
        continue
    print(f)

# # Вправа 10: Вираз в один рядок
print("\n=== ВПРАВА 10: Вираз з умовою в один рядок ===")
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
 """
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [i**2 for i in numbers if i%2==0]
print(result)  #  [4, 16, 36, 64, 100]